# Ultralytics YOLO 🚀

nc: 5

scales:
  m: [0.67, 0.75, 768]  #YOLOv8m-goldP2 summary: 331 layers, 22,812,912 parameters, 22,812,896 gradients, 70.1 GFLOPs

# =========================
# Backbone
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2

  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4

  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6

  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8

  - [-1, 1, SimSPPF, [1024, 5]]     # 9
  - [-1, 1, SimAM, []]              # 10

# =========================
# Head
# =========================
head:

  - [[2, 4, 6, 10], 1, SimFusion_4in, []] # 11
  - [-1, 1, IFM, [[64, 32]]]              # 12

  - [10, 1, Conv, [512, 1, 1]] # 13

  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 14

  - [[-1, 12], 1,InjectionMultiSum_Auto_pool,[512, [64, 32], 0]] # 15

  - [-1, 3, C2f, [512, False]] # 16

  # =====================
  # P3 branch
  # =====================
  - [6, 1, Conv, [256, 1, 1]] # 17

  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 18

  - [[-1, 12], 1,InjectionMultiSum_Auto_pool,[256, [64, 32], 1]] # 19

  - [-1, 3, C2f, [256, False]] # 20

  # =====================
  # Global aggregation
  # =====================
  - [[20, 16, 10], 1, PyramidPoolAgg, [352, 2]] # 21
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 22

  # =====================
  # p4 branch
  # =====================
  - [[20, 17], 1, AdvPoolFusion, []] # 23
  - [[-1, 22], 1,InjectionMultiSum_Auto_pool,[256, [64, 128], 0]] # 24
  - [-1, 3, C2f, [256, False]] # 25

  - [20, 1, SimAM, []] # 26
  - [25, 1, SimAM, []] # 27

  # ==================================================
  # NEW P2 BRANCH
  # ==================================================

  - [[2, 4, 10], 1, SimFusion_3in, [128]] # 28

  - [[-1, 12], 1,Inject_PConv,[128, [64, 32], 0]] # 29

  - [-1, 2, C2f, [128, False]] # 30

  - [30, 1, SimAM, []] # 31

  # =====================
  # Detect
  # =====================
  # P2 P3 P4
  - [[31, 26, 27], 1, Detect, [nc]]