# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  #YOLOv8m-goldFCE summary: 383 layers, 18,054,006 parameters, 18,053,990 gradients, 53.0 GFLOPs
  m: [0.67, 0.75, 768] #YOLOv8m-goldFCEv2 summary: 436 layers, 15,552,492 parameters, 15,552,476 gradients, 45.2 GFLOPs
# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SimSPPF, [1024, 5]]     # 9
  - [-1, 1, SimAM, []]              # 10

# YOLOv8.0n head
head:

  - [[2, 4, 6, 10], 1, SimFusion_4in, []] # 11
  - [-1, 1, IFM, [[64, 32]]]              # 12

  # =====================
  # P4 branch
  # =====================
  - [10, 1, Conv, [512, 1, 1]] # 13

  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 14

  - [[-1, 12], 1,
      InjectionMultiSum_Auto_pool,
      [512, [64, 32], 0]] # 15

  - [-1, 3, Fast_C2f_EMA, [512, False]] # 16

  # =====================
  # P3 branch
  # =====================
  - [6, 1, Conv, [256, 1, 1]] # 17

  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 18

  - [[-1, 12], 1,
      InjectionMultiSum_Auto_pool,
      [256, [64, 32], 1]] # 19

  - [-1, 3, Fast_C2f_EMA, [256, False]] # 20

  # =====================
  # Global aggregation
  # =====================
  - [[20, 16, 10], 1, PyramidPoolAgg, [352, 2]] # 21

  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 22

  # =====================
  # Refined P3
  # =====================
  - [[20, 17], 1, AdvPoolFusion, []] # 23

  - [[-1, 22], 1,
      InjectionMultiSum_Auto_pool,
      [256, [64, 128], 0]] # 24

  - [-1, 3, Fast_C2f_EMA, [256, False]] # 25

  # =====================
  # Refined P4
  # =====================
  - [[-1, 13], 1, AdvPoolFusion, []] # 26

  - [[-1, 22], 1,
      InjectionMultiSum_Auto_pool,
      [512, [64, 128], 1]] # 27

  - [-1, 3, Fast_C2f_EMA, [512, False]] # 28

  - [25, 1, SimAM, []] # 29
  - [28, 1, SimAM, []] # 30

  # ==================================================
  # NEW P2 BRANCH
  # ==================================================

  - [4, 1, Conv, [128, 1, 1]] # 31

  - [[2, 4, -1], 1, SimFusion_3in, [128]] # 32

  - [[-1, 12], 1,
      InjectionMultiSum_Auto_pool,
      [128, [64, 32], 0]] # 33

  - [-1, 2, Fast_C2f_EMA, [128, False]] # 34

  - [34, 1, SimAM, []] # 35

  # =====================
  # Detect
  # =====================
  # P2 P3 P4
  - [[35, 29, 30], 1, Detect, [nc]]