# Ultralytics YOLO 🚀, AGPL-3.0 license
# Gold-YOLO object detection model with P2-P4 outputs (No P5).

# Parameters
nc: 5 # number of classes
scales: 
  m: [0.67, 0.75, 768] #YOLOv8m-goldP2v5 summary: 360 layers, 15,793,557 parameters, 15,793,541 gradients, 84.7 GFLOPs

# YOLOv8.0n backbone (Giữ nguyên cấu trúc để trích xuất đủ P2 đến P5)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4  (Sẽ làm đầu ra P2)
  - [-1, 3, C2f, [128, True]]   # 2       
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8  (Sẽ làm đầu ra P3)
  - [-1, 6, C2f, [256, True]]   # 4       
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16 (Sẽ làm đầu ra P4)
  - [-1, 6, C2f, [512, True]]   # 6       
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32 (Vẫn giữ ở backbone để lấy ngữ cảnh toàn cục sâu nhất)
  - [-1, 3, C2f, [1024, True]]  # 8       
  - [-1, 1, SimSPPF, [1024, 5]]     # 9       
  - [-1, 1, SimAM, []]              # 10

# Gold-YOLO Head cấu hình lại cho P2, P3, P4
head:
  # --- GIAI ĐOẠN GATHER (THU THẬP TÍNH NĂNG NÔNG ĐỂ TIÊM CHO P2 VÀ P3) ---
  # Đổi SimFusion_4in gom từ [1, 2, 4, 6] thay vì [2, 4, 6, 10]
  - [[1, 2, 4, 6], 1, SimFusion_4in, []] # 11
  # Khối IFM nén kênh lại, hạ độ rộng kênh xuống cho phù hợp tầng nông [32, 16]
  - [-1, 1, IFM, [[32, 16]]] # 12

  # --- GIAI ĐOẠN TRỘN TÍNH NĂNG TẦNG SÂU (BỎ P5, CHỈ TRỘN ĐẾN P4) ---
  - [6, 1, Conv, [384, 1, 1]] # 13 (Hạ từ tầng 10 xuống tầng 6 - Đỉnh cao nhất giờ là P4)
  # Khối SimFusion_3in gom từ các tầng [2, 4, -1] để phục vụ cho nhánh P4
  - [[2, 4, -1], 1, SimFusion_3in, [384]] # 14
  - [[-1, 12], 1, Inject_PConv, [384, [32, 16], 0]] # 15
  - [-1, 3, Fast_C2f, [384, False]] # 16 (Đầu ra thô của nhánh P4)

  # Nhánh phục vụ cho P3
  - [4, 1, Conv, [192, 1, 1]] # 17 
  - [[1, 2, -1], 1, SimFusion_3in, [192]] # 18
  - [[-1, 12], 1, Inject_PConv, [192, [32, 16], 1]] # 19
  - [-1, 3, Fast_C2f, [192, False]] # 20 (Đầu ra thô của nhánh P3)

  # Nhánh phục vụ cho P2 (Nhánh siêu nhỏ được thêm mới)
  - [2, 1, Conv, [96, 1, 1]] # 21
  - [[1, -1], 1, Concat, [1]] # 22 (Tầng 1 và tầng 21 kết hợp)
  - [-1, 3, Fast_C2f, [96, False]] # 23 (Đầu ra thô của nhánh P2)

  # --- GIAI ĐOẠN PHÂN PHỐI NGƯỢC (DISTRIBUTE VIA PYRAMID POOL AGG) ---
  # Gom thông tin từ các đầu ra thô [23, 20, 16] (tương ứng P2, P3, P4)
  - [[23, 20, 16], 1, PyramidPoolAgg, [224, 2]] # 24
  # Khối TopBasicLayer sinh ma trận chú ý toàn cục mới cho P2, P3, P4
  - [-1, 1, TopBasicLayer, [224, [32, 64]]] # 25

  # Tiêm thông tin ngược lại cho đầu ra P2
  - [[23, 17], 1, AdvPoolFusion, []] # 26
  - [[-1, 25], 1, Inject_PConv, [96, [32, 64], 0]] # 27
  - [-1, 3, Fast_C2f, [96, False]] # 28 -> ĐẦU RA CHÍNH THỨC CỦA P2
  - [-1, 1, EMA, []] # 29 (Làm mịn P2)

  # Tiêm thông tin ngược lại cho đầu ra P3
  - [[20, 13], 1, AdvPoolFusion, []] # 30
  - [[-1, 25], 1, Inject_PConv, [192, [32, 64], 1]] # 31
  - [-1, 3, Fast_C2f, [192, False]] # 32 -> ĐẦU RA CHÍNH THỨC CỦA P3
  - [-1, 1, EMA, []] # 33 (Làm mịn P3)

  # Đầu ra P4 (Lấy từ khối 16 đã làm thô, đưa qua SimAM làm mịn)
  - [16, 1, EMA, []] # 34 -> ĐẦU RA CHÍNH THỨC CỦA P4

  # --- TẦNG ĐẦU RA DỰ ĐOÁN (DETECT HEAD) ---
  # Thay đổi ngỏ vào thành [29, 33, 34] tương ứng với P2, P3, P4
  - [[29, 33, 34], 1, Detect, [nc]] # 35: Detect(P2, P3, P4)