# Ultralytics YOLO 🚀

nc: 5

scales:
  m: [0.67, 0.75, 768]  #YOLOv8m-goldFCEv2 summary: 310 layers, 18,684,687 parameters, 18,684,671 gradients, 77.4 GFLOPs

# =========================
# Backbone
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, Fast_C2f_SimAM, [128, True]]       # 2

  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, Fast_C2f_SimAM, [256, True]]       # 4

  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, Fast_C2f_SimAM, [512, True]]       # 6

  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, Fast_C2f_SimAM, [1024, True]]      # 8

  - [-1, 1, SimSPPF, [1024, 5]]     # 9
  - [-1, 1, SimAM, []]              # 10

# =========================
# Head
# =========================
head:

  - [[2, 4, 6, 10], 1, SimFusion_4in, []] # 11
  - [-1, 1, IFM, [[64, 32]]]              # 12

  - [10, 1, Conv, [512, 1, 1]] # 13

  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 14

  - [[-1, 12], 1,InjectionMultiSum_Auto_pool,[512, [64, 32], 0]] # 15

  - [-1, 3, Fast_C2f, [512, False]] # 16

  # =====================
  # P3 branch
  # =====================
  - [6, 1, Conv, [256, 1, 1]] # 17

  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 18

  - [[-1, 12], 1,InjectionMultiSum_Auto_pool,[256, [64, 32], 1]] # 19

  - [-1, 3, Fast_C2f, [256, False]] # 20

  # =====================
  # Global aggregation
  # =====================
  - [[20, 16, 10], 1, PyramidPoolAgg, [352, 2]] # 21
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 22

  # =====================
  # p4 branch
  # =====================
  - [[20, 17], 1, AdvPoolFusion, []] # 23
  - [[-1, 22], 1,InjectionMultiSum_Auto_pool,[256, [64, 128], 0]] # 24
  - [-1, 3, Fast_C2f, [256, False]] # 25

  - [20, 1, SimAM, []] # 26
  - [25, 1, SimAM, []] # 27

  # ==================================================
  # NEW P2 BRANCH
  # ==================================================

  - [20, 1, nn.Upsample, [None, 2, 'nearest']]                     # 28
  - [[-1, 2], 1, Concat, [1]]                                      # 29
  - [-1, 3, Fast_C2f, [128, False]]                                # 30
  - [-1, 1, SimAM, []] # 31

  # =====================
  # Detect
  # =====================
  # P2 P3 P4
  - [[31, 26, 27], 1, Detect, [nc]]