# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 custom architecture for small objects (Detects on P2, P3, P4)

# Parameters
nc: 80  # number of classes
scales: # [depth, width, max_channels]
  m: [0.67, 0.75, 768] #YOLOv8m-goldFCEv10 summary: 206 layers, 16,049,488 parameters, 16,049,472 gradients, 78.0 GFLOPs

# =========================
# Backbone
# =========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2 (Nhánh P2 sẽ được nối vào Neck ở đây)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4 (Nhánh P3)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6 (Nhánh P4)
  
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8 
  - [-1, 1, SimSPPF, [1024, 5]]  # 9 (Vẫn giữ P5 trong Backbone để lấy ngữ cảnh sâu)

# =========================
# Head (Neck + Detect)
# =========================
head:
  # --- DÒNG CHẢY TỪ TRÊN XUỐNG (Top-Down) ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10 (Upsample P5)
  - [[-1, 6], 1, Concat, [1]]  # 11: Nối với P4 từ Backbone
  - [-1, 3, Fast_C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 (Upsample P4)
  - [[-1, 4], 1, Concat, [1]]  # 14: Nối với P3 từ Backbone
  - [-1, 3, Fast_C2f, [256]]  # 15

  # --- MỞ RỘNG THÊM NHÁNH P2 (Bắt vật thể siêu nhỏ) ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16 (Upsample P3 xuống P2)
  - [[-1, 2], 1, Concat, [1]]  # 17: Nối với P2 từ Backbone
  - [-1, 3, Fast_C2f, [128]]  # 18 -> ĐẦU RA P2 (Stride 4)

  # --- DÒNG CHẢY TỪ DƯỚI LÊN (Bottom-Up) ---
  - [-1, 1, Conv, [128, 3, 2]] # 19 (Downsample P2)
  - [[-1, 15], 1, Concat, [1]] # 20: Nối với nhánh P3 ở tầng 15
  - [-1, 3, Fast_C2f, [256]]  # 21 -> ĐẦU RA P3 (Stride 8)

  - [-1, 1, Conv, [256, 3, 2]] # 22 (Downsample P3)
  - [[-1, 12], 1, Concat, [1]] # 23: Nối với nhánh P4 ở tầng 12
  - [-1, 3, Fast_C2f, [512]]  # 24 -> ĐẦU RA P4 (Stride 16)

  # =====================
  # Detect
  # =====================
  # Chỉ xuất ra 3 nhánh: P2, P3, và P4 (Bỏ hoàn toàn P5)
  - [[18, 21, 24], 1, Detect, [nc]]  # 25