# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 custom architecture for small objects (Detects on P2, P3, P4)

# Parameters
nc: 80  # number of classes
scales: # [depth, width, max_channels]
  m: [0.67, 0.75, 768] #YOLOv8m-goldFCEv10 summary: 206 layers, 16,049,488 parameters, 16,049,472 gradients, 78.0 GFLOPs

# =========================
# Backbone
# =========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, Fast_C2f_SimAM, [128, True]]  # 2 (Nhánh P2 sẽ được nối vào Neck ở đây)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, Fast_C2f_SimAM, [256, True]]  # 4 (Nhánh P3)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, Fast_C2f_SimAM, [512, True]]  # 6 (Nhánh P4)
  
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, Fast_C2f_SimAM, [1024, True]]  # 8 
  - [-1, 1, SimSPPF, [1024, 5]]  # 9 (Vẫn giữ P5 trong Backbone để lấy ngữ cảnh sâu)
  - [-1, 1, SimAM, []]  # 10

# =========================
# Head (Neck + Detect)
# =========================
head:
  # --- DÒNG CHẢY TỪ TRÊN XUỐNG (Top-Down) ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11 (Upsample P5)
  - [[-1, 6], 1, Concat, [1]]  # 12: Nối với P4 từ Backbone
  - [-1, 3, Fast_C2f, [512]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 (Upsample P4)
  - [[-1, 4], 1, Concat, [1]]  # 15: Nối với P3 từ Backbone
  - [-1, 3, Fast_C2f, [256]]  # 16

  # --- MỞ RỘNG THÊM NHÁNH P2 (Bắt vật thể siêu nhỏ) ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 (Upsample P3 xuống P2)
  - [[-1, 2], 1, Concat, [1]]  # 18: Nối với P2 từ Backbone
  - [-1, 3, Fast_C2f, [128]]  # 19 -> ĐẦU RA P2 (Stride 4)

  # --- DÒNG CHẢY TỪ DƯỚI LÊN (Bottom-Up) ---
  - [-1, 1, Conv, [128, 3, 2]] # 20 (Downsample P2)
  - [[-1, 15], 1, Concat, [1]] # 21: Nối với nhánh P3 ở tầng 15
  - [-1, 3, Fast_C2f, [256]]  # 22 -> ĐẦU RA P3 (Stride 8)

  - [-1, 1, Conv, [256, 3, 2]] # 23 (Downsample P3)
  - [[-1, 12], 1, Concat, [1]] # 24: Nối với nhánh P4 ở tầng 12
  - [-1, 3, Fast_C2f, [512]]  # 25 -> ĐẦU RA P4 (Stride 16)

  # =====================
  # Detect
  # =====================
  # Chỉ xuất ra 3 nhánh: P2, P3, và P4 (Bỏ hoàn toàn P5)
  - [[19, 22, 25], 1, Detect, [nc]]  # 25